{
  "name": "Ricardo Guillen Irizarry",
  "title": "Sr. Frontend Developer",
  "email": "r.arturogi@gmail.com",
  "phone": "+1829-513-7582",
  "summary": "8+ years of experience as a front-end developer, Strong track record delivering high-impact software solutions and mentoring junior developers. Expertise in JavaScript libraries and frameworks such as Vue 3, React 18, Next.js 13, and Nuxt 3, combined with proficiency in state management systems and tools such as Redux and Vuex, allows me to craft scalable and performant applications that drive business growth. Expert in front-end development, Skilled in developing custom design systems using tools such as Tailwind CSS, which allows me to create visually stunning user experiences that leave a lasting impression. Also Skilled in onboarding and mentoring junior developers, helping them to reach their full potential and achieve our shared goals.",
  "twitter": "https://twitter.com/ryarturogi",
  "linkedin": "https://linkedin.com/in/ryarturogi",
  "portfolio": "https://ryarturogi.github.io",
  "location": {
    "city": "Jarabacoa",
    "state": "La Vega",
    "country": "Dominican Republic",
    "url": "https://goo.gl/maps/4HmfWF1pZXYhWPwy7"
  },
  "workExperience": [
    {
      "title": "Sr. Frontend Developer",
      "company": "Elaniin",
      "dates": "Jan 2021 - Dec 2022",
      "location": "El Salvador - Remote",
      "type": "Full-time",
      "responsibilities": [
        "Lead junior frontend development teams to develop complex projects and designed/implemented technical solutions for the company",
        "Work with cross-functional teams to define technical requirements and architecture for new features/products and ensure that the technical solutions are aligned with the business goals",
        "Implement advanced performance optimization techniques such as code splitting, lazy loading, and server-side rendering to improve the performance of the web applications",
        "Develop custom design systems and style guides to ensure design consistency and maintainability across multiple products/platforms and work with the design team to implement the designs",
        "Collaborate with the security team to implement various security measures such as CORS, XSS protection, and content security policies to ensure the security of the web applications",
        "Work with the QA team to develop and maintain automated testing frameworks and integrations to ensure the quality of the web applications"
      ],
      "accomplishments": [
        "Contributed to the development of a new module for local sellers on the #1 Salvadoran e-commerce website, providing a platform for SMBs to sell products online and increasing revenue by 20%",
        "Created a dynamic and interactive dashboard for financial reporting application using Vue, improving the data visualization and usability of the Credicomer: Banca digital application by 30%",
        "Worked with the design team to develop a cohesive visual style for the AlayaCare SaaS platform using Tailwind CSS and Vue, improving the user experience and increasing customer retention by 10%",
        "Led team of 4-6 front-end developers to develop a financial banking system web app using React and Next.js for Credicomer, a Salvadorean bank with over 1 million customers",
        "Collaborated with back-end developers to integrate a series of API calls using Next.js, improving data retrieval and overall functionality of the application",
        "Trained and mentored junior front-end developers, resulting in improved efficiency and productivity within the team and a 20% reduction in development time",
        "Worked with project managers to develop detailed project plans and deliverables, ensuring timely and successful project completion for companies in the USA and internationally (El Salvador, Guatemala, Colombia, and Mexico)",
        "Implemented server-side rendering solution using Next.js that improved initial page load time by 50% and increased SEO visibility by 30%",
        "Developed and maintained TypeScript array utility library that has been downloaded over 5,000 times on npm and is widely used within the community to improve code readability and maintainability"
      ]
    },
    {
      "title": "Sr. Frontend Developer",
      "company": "Mercandu",
      "dates": "Oct 2022 - Nov 2022",
      "location": "El Salvador - Remote",
      "type": "Full-time",
      "responsibilities": [
        "Integration and development of multiple modules for managing local sellers.",
        "Development of the new Mercandu Pay, a new payment gateway.",
        "Refactor multiple sections of the e-commerce website and mobile app to improve the performance of loading time.",
        "Collaboration with the design and marketing teams to ensure a consistent and user-friendly experience."
      ],
      "accomplishments": [
        "Improved delivery time to production for new local seller features by 150% in the first week and 200% in the second spring.",
        "Enhanced routing and worked with the design team to enhance the user experience and user satisfaction on the e-commerce website.",
        "Streamlined processes and increased efficiency with the team to improve the process of deploying code to production by 20% faster."
      ]
    },
    {
      "title": "Frontend Developer",
      "company": "Contrata.com",
      "dates": "Feb 2016 - Jan 2021",
      "location": "Dominican Republic - Remote",
      "type": "Full-time",
      "responsibilities": [
        "Migrating the website from WordPress to the VueJs framework NuxtJs, and maintaining and updating the Front-End on an ongoing basis.",
        "Developing custom features, such as a landing page builder and an inquiry management system, to improve the user experience and enhance the website's performance.",
        "Utilizing a range of technologies, including JavaScript, VueJs, NuxtJs, and WordPress, to develop and integrate web interfaces for the web application.",
        "Collaborating with the rest of the development team to ensure the successful implementation of new features and the smooth operation of the website.",
        "Staying up-to-date with the latest frontend development trends and techniques, and incorporating them into the website as appropriate."
      ],
      "accomplishments": [
        "Successfully migrated the website from WordPress to NuxtJs, improving website performance by 50%.",
        "Developed custom features that improved the user experience and increased website traffic by 20%.",
        "Utilized a range of technologies to develop and integrate web interfaces, resulting in a satisfaction rate of 95% among users.",
        "Collaborated effectively with the development team to ensure the smooth operation of the website and the successful implementation of new features.",
        "Stayed up-to-date with the latest frontend development trends and techniques, resulting in a 25% increase in efficiency and productivity."
      ]
    },
    {
      "title": "WordPress Developer",
      "company": "Doble Group",
      "dates": "Mar 2013 - May 2016",
      "years": "3 years 3 months",
      "location": "Miami, FL, Estados Unidos - Remote",
      "type": "Contract",
      "responsibilities": [
        "Developing and redesigning the website, doblegroup.com, to ensure that it is user-friendly and performs well.",
        "Creating a landing page system to improve the website's SEO and increase its visibility online.",
        "Designing and developing all the email templates for the brand, using technologies such as Drupal, WordPress, Bootstrap, HTML5, CSS3, and MySQL.",
        "Collaborating with the rest of the team to ensure the successful implementation of new features and the smooth operation of the website.",
        "Staying up-to-date with the latest web development trends and techniques, and incorporating them into the website as appropriate."
      ],
      "accomplishments": [
        "Improved website usability by 50% through redesign efforts",
        "Increased website traffic by 30% through the implementation of a landing page system",
        "Designed and developed 10 successful email templates that increased customer engagement by 20%",
        "Successfully collaborated with the team to launch several new website features on time and without any issues",
        "Stayed current on the latest web development trends, leading to the implementation of several innovative features on the website that improved performance and user experience"
      ]
    }
  ],
  "education": [
    {
      "career": "Graphic Design",
      "institution": "Universidad APEC",
      "degree": "Incomplete bachelor's",
      "dates": "2006 - 2008",
      "location": "Santo Domingo, Dominican Republic"
    },
    {
      "career": "High-School",
      "institution": "Colegio Arroyo Hondo",
      "degree": "High-School Diploma",
      "dates": "2002 - 2006",
      "location": "Santo Domingo, Dominican Republic"
    }
  ],
  "softskills": [
    "Active Listening",
    "Adaptability",
    "Analytical Thinking",
    "Attention to Detail",
    "Communication",
    "Critical Thinking",
    "Creativity",
    "Decision Making",
    "Flexibility",
    "Organization",
    "Problem Solving",
    "Resilience",
    "Self-Motivation",
    "Teamwork",
    "Time Management"
  ],
  "hardskills": [
    "CSS3",
    "HTML5",
    "JavaScript",
    "NoSQL",
    "NextJs",
    "NuxtJs",
    "React",
    "TailwindCSS",
    "TypeScript",
    "VueJs"
  ],
  "languages": [
    {
      "language": "Spanish",
      "level": "Native - C2"
    },
    {
      "language": "English",
      "level": "Intermediate - B2"
    }
  ]
}
